app/views/trip/trip_page.html.erb

SELECT  "trip_images".* FROM "trip_images"  WHERE "trip_images"."trip_id" = ?  ORDER BY "trip_images"."id" ASC LIMIT 1  [["trip_id", 1]]
---
            <div class='col-md-4'>
                <img src="<%= @trip.trip_images.first.url %>" />