app/controllers/home_controller.rb

    def index
        @trip = Trip.first
        @users = @trip.users
        @comments = @trip.comments.order(priorty: :desc, created_at: :desc).limit(5)
        @places = Place.all.limit(3)
---
SELECT  "trips".* FROM "trips"   ORDER BY "trips"."id" ASC LIMIT 1
SELECT  "places".* FROM "places"  LIMIT 3

    def trip_page
        @trip = Trip.find_by(page_name: params[:page_name])
---
SELECT  "trips".* FROM "trips"  WHERE "trips"."page_name" = 'bmout' LIMIT 1