app/controllers/trip_controller.rb

SELECT  "trips".* FROM "trips"  WHERE "trips"."page_name" = 'BournmouthWeekendCoachTrip' LIMIT 1
---
    def trip_page
        @trip = Trip.find_by(page_name: params[:page_name])